'''
比较不同场景下的网络时延：
1.比较不同数量的服务请求场景下：
(1)服务请求数量:10(AI:4),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
(2)服务请求数量:20(AI:7),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
(3)服务请求数量:30(AI:10),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
(4)服务请求数量:40(AI:13),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
(5)服务请求数量:50(AI:16),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3

2.比较不同长度的服务请求场景下：
(1)服务请求数量:30(AI:10),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
(2)服务请求数量:30(AI:10),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
(3)服务请求数量:30(AI:10),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
(4)服务请求数量:30(AI:10),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
(5)服务请求数量:30(AI:10),服务请求长度:最小3,最大7(基础:3-6,AI:4-7),服务器数量:10,到达率:2-4,基础微服务:12,AI微服务:3
'''